#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2023z-300215/global/networks/main-vpc]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2023z-300215/regions/europe-west1/subnetworks/subnet-01]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2023z-300215/global/firewalls/fw-allow-ingress-iap]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2023z-300215/global/firewalls/default-internal-allow-all]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2023z-300215/regions/europe-west1/routers/nat-router]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2023z-300215/global/routes/egress-internet]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2023z-300215/europe-west1/nat-router/nat-gateway]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2023z-300215/regions/europe-west1/subnetworks/composer-subnet-01]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.composer.google_project_iam_member.composer-member will be created
  + resource "google_project_iam_member" "composer-member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "tbd-2023z-300215"
      + role    = "roles/composer.worker"
    }

  # module.composer.google_project_iam_member.dataproc-editor-iam will be created
  + resource "google_project_iam_member" "dataproc-editor-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "tbd-2023z-300215"
      + role    = "roles/dataproc.editor"
    }

  # module.composer.google_project_iam_member.dataproc-sa-user-iam will be created
  + resource "google_project_iam_member" "dataproc-sa-user-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "tbd-2023z-300215"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.composer.google_project_service.api["composer.googleapis.com"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "tbd-2023z-300215"
      + service            = "composer.googleapis.com"
    }

  # module.composer.google_service_account.tbd-composer-sa will be created
  + resource "google_service_account" "tbd-composer-sa" {
      + account_id = "tbd-2023z-300215-data"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = "tbd-2023z-300215"
      + unique_id  = (known after apply)
    }

  # module.data-pipelines.google_storage_bucket.tbd-code-bucket will be created
  + resource "google_storage_bucket" "tbd-code-bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "tbd-2023z-300215-code"
      + project                     = "tbd-2023z-300215"
      + public_access_prevention    = "enforced"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = false
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.data-pipelines.google_storage_bucket.tbd-data-bucket will be created
  + resource "google_storage_bucket" "tbd-data-bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "tbd-2023z-300215-data"
      + project                     = "tbd-2023z-300215"
      + public_access_prevention    = "enforced"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = false
      + url                         = (known after apply)
    }

  # module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer will be created
  + resource "google_storage_bucket_iam_member" "tbd-code-bucket-iam-viewer" {
      + bucket = "tbd-2023z-300215-code"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor will be created
  + resource "google_storage_bucket_iam_member" "tbd-data-bucket-iam-editor" {
      + bucket = "tbd-2023z-300215-data"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectUser"
    }

  # module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"] will be created
  + resource "google_storage_bucket_object" "dag-code" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/data-pipeline/resources/data-dag.py"
      + storage_class  = (known after apply)
    }

  # module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"] will be created
  + resource "google_storage_bucket_object" "job-code" {
      + bucket         = "tbd-2023z-300215-code"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "spark-job.py"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/data-pipeline/resources/spark-job.py"
      + storage_class  = (known after apply)
    }

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster will be created
  + resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
      + graceful_decommission_timeout = "0s"
      + id                            = (known after apply)
      + labels                        = (known after apply)
      + name                          = "tbd-cluster"
      + project                       = "tbd-2023z-300215"
      + region                        = "europe-west1"

      + cluster_config {
          + bucket      = (known after apply)
          + temp_bucket = (known after apply)

          + gce_cluster_config {
              + internal_ip_only       = true
              + metadata               = {
                  + "PIP_PACKAGES" = "pandas<2 mlflow==2.3.1 google-cloud-storage==2.9.0"
                  + "vmDnsSetting" = "GlobalDefault"
                }
              + network                = (known after apply)
              + service_account_scopes = (known after apply)
              + subnetwork             = "projects/tbd-2023z-300215/regions/europe-west1/subnetworks/subnet-01"
              + zone                   = (known after apply)
            }

          + initialization_action {
              + script      = "gs://goog-dataproc-initialization-actions-europe-west1/python/pip-install.sh"
              + timeout_sec = 600
            }

          + master_config {
              + image_uri        = (known after apply)
              + instance_names   = (known after apply)
              + machine_type     = "e2-standard-2"
              + min_cpu_platform = (known after apply)
              + num_instances    = 1

              + disk_config {
                  + boot_disk_size_gb = 100
                  + boot_disk_type    = "pd-standard"
                  + num_local_ssds    = (known after apply)
                }
            }

          + software_config {
              + image_version = "2.1.27-ubuntu20"
              + properties    = (known after apply)
            }

          + worker_config {
              + image_uri        = (known after apply)
              + instance_names   = (known after apply)
              + machine_type     = "e2-standard-2"
              + min_cpu_platform = (known after apply)
              + num_instances    = 2

              + disk_config {
                  + boot_disk_size_gb = 100
                  + boot_disk_type    = "pd-standard"
                  + num_local_ssds    = (known after apply)
                }
            }
        }
    }

  # module.dataproc.google_project_service.dataproc will be created
  + resource "google_project_service" "dataproc" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "dataproc.googleapis.com"
    }

  # module.gcr.google_container_registry.registry will be created
  + resource "google_container_registry" "registry" {
      + bucket_self_link = (known after apply)
      + id               = (known after apply)
      + location         = "EU"
      + project          = "tbd-2023z-300215"
    }

  # module.gcr.google_project_service.api["containerregistry.googleapis.com"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "tbd-2023z-300215"
      + service            = "containerregistry.googleapis.com"
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2023z-300215/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "98b5648b76ecb399c72485825db65adcee65fa80"
        }

      + build {
          + build_args   = {
              + "JUPYTERLAB_VERSION" = "3.6.3"
              + "PROJECT_NAME"       = "tbd-2023z-300215"
            }
          + cache_from   = []
          + context      = "modules/docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2023z-300215/jupyter:latest",
            ]
        }
    }

  # module.jupyter_docker_image.docker_registry_image.jupyterlab will be created
  + resource "docker_registry_image" "jupyterlab" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "eu.gcr.io/tbd-2023z-300215/jupyter:3.6.3"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha1" = "98b5648b76ecb399c72485825db65adcee65fa80"
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2023z-300215"
      + skip_delete         = (known after apply)
    }

  # module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook will be created
  + resource "google_notebooks_instance" "tbd_notebook" {
      + create_time         = (known after apply)
      + id                  = (known after apply)
      + instance_owners     = [
          + "marek.wiewiorka@gmail.com",
        ]
      + labels              = (known after apply)
      + location            = "europe-west1-b"
      + machine_type        = "e2-standard-2"
      + metadata            = {
          + "vmDnsSetting" = "GlobalDefault"
        }
      + name                = "tbd-2023z-300215-notebook"
      + network             = "projects/tbd-2023z-300215/global/networks/main-vpc"
      + no_proxy_access     = true
      + no_public_ip        = true
      + post_startup_script = "gs://tbd-2023z-300215-conf/scripts/notebook_post_startup_script.sh"
      + project             = (known after apply)
      + proxy_uri           = (known after apply)
      + service_account     = (known after apply)
      + state               = (known after apply)
      + subnet              = "projects/tbd-2023z-300215/regions/europe-west1/subnetworks/subnet-01"
      + update_time         = (known after apply)

      + container_image {
          + repository = "eu.gcr.io/tbd-2023z-300215/jupyter"
          + tag        = "3.6.3"
        }
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be created
  + resource "google_project_iam_binding" "token_creator_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "tbd-2023z-300215"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.vertex_ai_workbench.google_project_service.notebooks will be created
  + resource "google_project_service" "notebooks" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "notebooks.googleapis.com"
    }

  # module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket will be created
  + resource "google_storage_bucket" "notebook-conf-bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "tbd-2023z-300215-conf"
      + project                     = (known after apply)
      + public_access_prevention    = "enforced"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be created
  + resource "google_storage_bucket_iam_binding" "binding" {
      + bucket  = "tbd-2023z-300215-conf"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + role    = "roles/storage.objectViewer"
    }

  # module.vertex_ai_workbench.google_storage_bucket_object.post-startup will be created
  + resource "google_storage_bucket_object" "post-startup" {
      + bucket         = "tbd-2023z-300215-conf"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "scripts/notebook_post_startup_script.sh"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/vertex-ai-workbench/resources/notebook_post_startup_script.sh"
      + storage_class  = (known after apply)
    }

  # module.composer.module.composer.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2023z-300215"
      + skip_delete         = (known after apply)
    }

  # module.composer.module.composer.google_composer_environment.composer_env will be created
  + resource "google_composer_environment" "composer_env" {
      + id      = (known after apply)
      + name    = "demo-lab"
      + project = "tbd-2023z-300215"
      + region  = "europe-west1"

      + config {
          + airflow_uri      = (known after apply)
          + dag_gcs_prefix   = (known after apply)
          + environment_size = "ENVIRONMENT_SIZE_SMALL"
          + gke_cluster      = (known after apply)
          + node_count       = (known after apply)
          + resilience_mode  = (known after apply)

          + node_config {
              + disk_size_gb         = (known after apply)
              + enable_ip_masq_agent = false
              + ip_allocation_policy = (known after apply)
              + machine_type         = (known after apply)
              + max_pods_per_node    = (known after apply)
              + network              = "projects/tbd-2023z-300215/global/networks/main-vpc"
              + oauth_scopes         = (known after apply)
              + service_account      = (known after apply)
              + subnetwork           = "projects/tbd-2023z-300215/regions/europe-west1/subnetworks/composer-subnet-01"
              + zone                 = (known after apply)
            }

          + software_config {
              + env_variables   = {
                  + "AIRFLOW_VAR_BUCKET_NAME" = "tbd-2023z-300215-code"
                  + "AIRFLOW_VAR_PHS_CLUSTER" = "tbd-cluster"
                  + "AIRFLOW_VAR_PROJECT_ID"  = "tbd-2023z-300215"
                  + "AIRFLOW_VAR_REGION_NAME" = "europe-west1"
                }
              + image_version   = "composer-2.4.6-airflow-2.6.3"
              + python_version  = (known after apply)
              + scheduler_count = (known after apply)
            }

          + workloads_config {
              + scheduler {
                  + count      = 1
                  + cpu        = 0.5
                  + memory_gb  = 1.875
                  + storage_gb = 1
                }
              + web_server {
                  + cpu        = 0.5
                  + memory_gb  = 1.875
                  + storage_gb = 1
                }
              + worker {
                  + cpu        = 0.5
                  + max_count  = 3
                  + memory_gb  = 1.875
                  + min_count  = 1
                  + storage_gb = 1
                }
            }
        }
    }

  # module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0] will be created
  + resource "google_project_iam_member" "composer_agent_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "tbd-2023z-300215"
      + role    = "roles/composer.ServiceAgentV2Ext"
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dandon223, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*